// Title: Registry - Attachment Manager ScanWithAntiVirus (30d)
// Purpose: Detect modifications to the ScanWithAntiVirus registry flag under Attachment Manager policies
// Scope: Windows 10/11, Server 2016+
// Tables: DeviceRegistryEvents
// Tunables:
//   - Time range: change `ago(30d)` as needed
//   - Registry path: currently scoped to Attachment Manager key
// Author: Lokis-Lab  |  License: MIT
// Last Updated: 2025-09-10

DeviceRegistryEvents
| where Timestamp > ago(30d)
| where RegistryKey endswith @"\Software\Microsoft\Windows\CurrentVersion\Policies\Attachments"
| where RegistryValueName == "ScanWithAntiVirus"
| project Timestamp, DeviceName, RegistryKey, RegistryValueName, RegistryValueData, ActionType, InitiatingProcessFileName
